Wing-Hin/COMPSYS301/Software/CS301_Class.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "Clock_PWM.h"
#include "M1_IN1_aliases.h"
#include "M1_IN1.h"
#include "M1_IN2_aliases.h"
#include "M1_IN2.h"
#include "M2_IN1_aliases.h"
#include "M2_IN1.h"
#include "M2_IN2_aliases.h"
#include "M2_IN2.h"
#include "QuadDec_M1.h"
#include "M2_D1_aliases.h"
#include "M2_D1.h"
#include "QuadDec_M2.h"
#include "M1_QA_aliases.h"
#include "M1_QA.h"
#include "M1_QB_aliases.h"
#include "M1_QB.h"
#include "M2_QA_aliases.h"
#include "M2_QA.h"
#include "M2_QB_aliases.h"
#include "M2_QB.h"
#include "Q1_aliases.h"
#include "Q1.h"
#include "ADC_Sensor.h"
#include "Q2_aliases.h"
#include "Q2.h"
#include "Q3_aliases.h"
#include "Q3.h"
#include "Q4_aliases.h"
#include "Q4.h"
#include "Q5_aliases.h"
#include "Q5.h"
#include "Q6_aliases.h"
#include "Q6.h"
#include "Timer_TS.h"
#include "USBUART.h"
#include "USBUART_audio.h"
#include "USBUART_cdc.h"
#include "USBUART_hid.h"
#include "USBUART_midi.h"
#include "USBUART_pvt.h"
#include "USBUART_cydmac.h"
#include "USBUART_msc.h"
#include "Clock2.h"
#include "M1_D1_aliases.h"
#include "M1_D1.h"
#include "CONTROL.h"
#include "UART.h"
#include "PWM_1.h"
#include "PWM_2.h"
#include "Clock_QENC.h"
#include "LED_aliases.h"
#include "LED.h"
#include "DB0_aliases.h"
#include "DB0.h"
#include "DB1_aliases.h"
#include "DB1.h"
#include "DB2_aliases.h"
#include "DB2.h"
#include "isrRF_TX.h"
#include "isrRF_RX.h"
#include "RF_BT_SELECT.h"
#include "Clock_Motor.h"
#include "Timer_Motor.h"
#include "isr_TM.h"
#include "LED_1_aliases.h"
#include "LED_1.h"
#include "LED_2_aliases.h"
#include "LED_2.h"
#include "LWE_aliases.h"
#include "LWE.h"
#include "LWV_aliases.h"
#include "LWV.h"
#include "RWE_aliases.h"
#include "RWE.h"
#include "RWV_aliases.h"
#include "RWV.h"
#include "LED_3_aliases.h"
#include "LED_3.h"
#include "LED_4_aliases.h"
#include "LED_4.h"
#include "LED_5_aliases.h"
#include "LED_5.h"
#include "LED_6_aliases.h"
#include "LED_6.h"
#include "QuadDec_M1_Cnt16.h"
#include "QuadDec_M2_Cnt16.h"
#include "ADC_Sensor_SAR.h"
#include "ADC_Sensor_IntClock.h"
#include "ADC_Sensor_TempBuf_dma.h"
#include "ADC_Sensor_FinalBuf_dma.h"
#include "ADC_Sensor_IRQ.h"
#include "USBUART_Dm_aliases.h"
#include "USBUART_Dm.h"
#include "USBUART_Dp_aliases.h"
#include "USBUART_Dp.h"
#include "UART_IntClock.h"
#include "cy_em_eeprom.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"

/*[]*/

